<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Uses parent pkg recipe to download latest Cricut Design Space and import it into the JSS.</string>
    <key>Identifier</key>
    <string>com.github.turbii.jss-upload.CricutDesignSpace</string>
    <key>Input</key>
    <dict>
        <key>CATEGORY</key>
	<string>Software</string>
	<key>GROUP_NAME</key>
	<string>%NAME%</string>
	<key>NAME</key>
	<string>CricutDesignSpace</string>
	<key>POLICY_CATEGORY</key>
	<string>Cricut Design Space</string>
	<key>POLICY_TEMPLATE</key>
	<string>PolicyTemplate-selfservice.xml</string>
	<key>RELEASE</key>
	<string>latest</string>
	<key>SELF_SERVICE_DESCRIPTION</key>
	<string>Cricut Design Space</string>
	<key>SELF_SERVICE_ICON</key>
	<string>Cricut.jpg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.nstrauss.pkg.CricutDesignSpace</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>category</key>
                <string>%CATEGORY%</string>
                <key>prod_name</key>
                <string>%NAME%</string>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
            </dict>
            <key>Processor</key>
            <string>JSSImporter</string>
        </dict>
    </array>
</dict>
</plist>
